JordyDH/esp-matter-lp/connectedhomeip/connectedhomeip/src/platform/ESP32/NetworkCommissioningDriver.cpp
exit:

    // Remove the backup.
    PersistedStorage::KeyValueStoreMgr().Delete(kWiFiSSIDKeyName);
    PersistedStorage::KeyValueStoreMgr().Delete(kWiFiCredentialsKeyName);

    return error;
}

bool ESPWiFiDriver::NetworkMatch(const WiFiNetwork & network, ByteSpan networkId)
{
    return networkId.size() == network.ssidLen && memcmp(networkId.data(), network.ssid, network.ssidLen) == 0;
}

Status ESPWiFiDriver::AddOrUpdateNetwork(ByteSpan ssid, ByteSpan credentials, MutableCharSpan & outDebugText,
                                         uint8_t & outNetworkIndex)
{
    ESP_LOGI(TAG, "ESPWiFiDriver - AddOrUpdateNetwork");
    outDebugText.reduce_size(0);
    outNetworkIndex = 0;
    VerifyOrReturnError(mStagingNetwork.ssidLen == 0 || NetworkMatch(mStagingNetwork, ssid), Status::kBoundsExceeded);
    VerifyOrReturnError(credentials.size() <= sizeof(mStagingNetwork.credentials), Status::kOutOfRange);
    VerifyOrReturnError(ssid.size() <= sizeof(mStagingNetwork.ssid), Status::kOutOfRange);
    VerifyOrReturnError(BackupConfiguration() == CHIP_NO_ERROR, Status::kUnknownError);

    memcpy(mStagingNetwork.credentials, credentials.data(), credentials.size());
    mStagingNetwork.credentialsLen = static_cast<decltype(mStagingNetwork.credentialsLen)>(credentials.size());

    memcpy(mStagingNetwork.ssid, ssid.data(), ssid.size());
    mStagingNetwork.ssidLen = static_cast<decltype(mStagingNetwork.ssidLen)>(ssid.size());

    return Status::kSuccess;
}

Status ESPWiFiDriver::RemoveNetwork(ByteSpan networkId, MutableCharSpan & outDebugText, uint8_t & outNetworkIndex)
{
    outDebugText.reduce_size(0);
    outNetworkIndex = 0;
    VerifyOrReturnError(NetworkMatch(mStagingNetwork, networkId), Status::kNetworkIDNotFound);
    VerifyOrReturnError(BackupConfiguration() == CHIP_NO_ERROR, Status::kUnknownError);

    // Use empty ssid for representing invalid network
    mStagingNetwork.ssidLen = 0;
    return Status::kSuccess;
}

Status ESPWiFiDriver::ReorderNetwork(ByteSpan networkId, uint8_t index, MutableCharSpan & outDebugText)
{
    outDebugText.reduce_size(0);

    // Only one network is supported now
    VerifyOrReturnError(index == 0, Status::kOutOfRange);
    VerifyOrReturnError(NetworkMatch(mStagingNetwork, networkId), Status::kNetworkIDNotFound);
    return Status::kSuccess;
}

CHIP_ERROR ESPWiFiDriver::ConnectWiFiNetwork(const char * ssid, uint8_t ssidLen, const char * key, uint8_t keyLen, uint8_t channel)
{
    // If device is already connected to WiFi, then disconnect the WiFi,
    // clear the WiFi configurations and add the newly provided WiFi configurations.
    if (chip::DeviceLayer::Internal::ESP32Utils::IsStationProvisioned())
    {
        ChipLogProgress(DeviceLayer, "Disconnecting WiFi station interface");
        esp_err_t err = esp_wifi_disconnect();
        if (err != ESP_OK)
        {
            ChipLogError(DeviceLayer, "esp_wifi_disconnect() failed: %s", esp_err_to_name(err));
            return chip::DeviceLayer::Internal::ESP32Utils::MapError(err);
        }
        CHIP_ERROR error = chip::DeviceLayer::Internal::ESP32Utils::ClearWiFiStationProvision();
        if (error != CHIP_NO_ERROR)
        {
            ChipLogError(DeviceLayer, "ClearWiFiStationProvision failed: %s", chip::ErrorStr(error));
            return chip::DeviceLayer::Internal::ESP32Utils::MapError(err);
        }
    }

    ReturnErrorOnFailure(ConnectivityMgr().SetWiFiStationMode(ConnectivityManager::kWiFiStationMode_Disabled));

    wifi_config_t wifiConfig;

    // Set the wifi configuration
    memset(&wifiConfig, 0, sizeof(wifiConfig));
    memcpy(wifiConfig.sta.ssid, ssid, std::min(ssidLen, static_cast<uint8_t>(sizeof(wifiConfig.sta.ssid))));
    memcpy(wifiConfig.sta.password, key, std::min(keyLen, static_cast<uint8_t>(sizeof(wifiConfig.sta.password))));
    wifiConfig.sta.listen_interval = 10;
    
    // If we know the channel, set it in the configuration
    if (channel > 0) {
        wifiConfig.sta.channel = channel;
        ChipLogProgress(DeviceLayer, "Setting WiFi connection to use channel %d", channel);
    }

    // Configure the ESP WiFi interface.
    esp_err_t err = esp_wifi_set_config(WIFI_IF_STA, &wifiConfig);
    if (err != ESP_OK)
    {
        ChipLogError(DeviceLayer, "esp_wifi_set_config() failed: %s", esp_err_to_name(err));
        return chip::DeviceLayer::Internal::ESP32Utils::MapError(err);
    }

    ReturnErrorOnFailure(ConnectivityMgr().SetWiFiStationMode(ConnectivityManager::kWiFiStationMode_Disabled));
    return ConnectivityMgr().SetWiFiStationMode(ConnectivityManager::kWiFiStationMode_Enabled);
}

#if CHIP_DEVICE_CONFIG_SUPPORTS_CONCURRENT_CONNECTION
CHIP_ERROR ESPWiFiDriver::DisconnectFromNetwork()
{
    if (chip::DeviceLayer::Internal::ESP32Utils::IsStationProvisioned())
    {
        // Attaching to an empty network will disconnect the network.
        ReturnErrorOnFailure(ConnectWiFiNetwork(nullptr, 0, nullptr, 0));
    }
    return CHIP_NO_ERROR;
}
#endif


#define WIFI_CONNECTED_DELAY 1000
#define WIFI_FAILED_DELAY 5000

void ESPWiFiDriver::OnConnectWiFiNetwork()
{
    // Create a mutex or semaphore to ensure this function completes before Matter continues
    static bool onConnectInProgress = false;
    
    // Only one connection callback should be processed at a time
    if (onConnectInProgress) {
        ESP_LOGI(TAG, "Another connect callback is already in progress, ignoring");
        return;
    }
    
    if (mpConnectCallback)
    {
        onConnectInProgress = true;
        
        // Cancel the connection failure timer since we've connected successfully
        DeviceLayer::SystemLayer().CancelTimer(OnConnectWiFiNetworkFailed, NULL);
        
        // Ensure a full delay to allow the system to stabilize after connection
        ESP_LOGI(TAG, "ONEDGE - WIFI CONNECTED - delay %d ms - START", WIFI_CONNECTED_DELAY);
        
        // Use a blocking delay to ensure the system is fully ready
        vTaskDelay(pdMS_TO_TICKS(WIFI_CONNECTED_DELAY));
        
        ESP_LOGI(TAG, "ONEDGE - WIFI CONNECTED - delay %d ms - END", WIFI_CONNECTED_DELAY);
        
        // Callback AFTER the delay completes
        if (mpConnectCallback) {
            mpConnectCallback->OnResult(Status::kSuccess, CharSpan(), 0);
            mpConnectCallback = nullptr;
        }
        
