JordyDH/esp-matter-lp/connectedhomeip/connectedhomeip/src/platform/ESP32/NetworkCommissioningDriver.cpp
        onConnectInProgress = false;
    }
}

void ESPWiFiDriver::OnConnectWiFiNetworkFailed()
{
    if (mpConnectCallback)
    {
        ESP_LOGI(TAG, "ONEDGE - WIFI FAILED - Disabling WiFi radio to save power");
        
        // Temporarily disable WiFi radio to save power
        esp_wifi_stop();
        
        // Add a significant delay to allow capacitors to recharge
        ESP_LOGI(TAG, "ONEDGE - WIFI FAILED - delay %d ms - START", WIFI_FAILED_DELAY);
        vTaskDelay(pdMS_TO_TICKS(WIFI_FAILED_DELAY));
        ESP_LOGI(TAG, "ONEDGE - WIFI FAILED - delay %d ms - END", WIFI_FAILED_DELAY);
        
        // Re-enable WiFi radio
        esp_wifi_start();
        ESP_LOGI(TAG, "ONEDGE - WIFI FAILED - Re-enabling WiFi radio");

        mpConnectCallback->OnResult(Status::kNetworkNotFound, CharSpan(), 0);
        mpConnectCallback = nullptr;
    }
}

void ESPWiFiDriver::OnConnectWiFiNetworkFailed(chip::System::Layer * aLayer, void * aAppState)
{
    CHIP_ERROR error = chip::DeviceLayer::Internal::ESP32Utils::ClearWiFiStationProvision();
    if (error != CHIP_NO_ERROR)
    {
        ChipLogError(DeviceLayer, "ClearWiFiStationProvision failed: %s", chip::ErrorStr(error));
    }
    ESPWiFiDriver::GetInstance().OnConnectWiFiNetworkFailed();
}

void ESPWiFiDriver::ConnectNetwork(ByteSpan networkId, ConnectCallback * callback)
{
    CHIP_ERROR err          = CHIP_NO_ERROR;
    Status networkingStatus = Status::kSuccess;
    Network configuredNetwork;
    const uint32_t secToMiliSec = 1000;
    
    // Declare all variables at the beginning of the function
    // to avoid jumping over initializations
    bool target_found = false;
    uint8_t target_channel = 0;
    int8_t target_rssi = -128;

    if (!NetworkMatch(mStagingNetwork, networkId)) {
        networkingStatus = Status::kNetworkIDNotFound;
        goto exit;
    }
    if (BackupConfiguration() != CHIP_NO_ERROR) {
        networkingStatus = Status::kUnknownError;
        goto exit;
    }
    if (mpConnectCallback != nullptr) {
        networkingStatus = Status::kUnknownError;
        goto exit;
    }
    ChipLogProgress(NetworkProvisioning, "ESP NetworkCommissioningDelegate: SSID: %.*s", static_cast<int>(networkId.size()),
                    networkId.data());
    if (CHIP_NO_ERROR == GetConfiguredNetwork(configuredNetwork))
    {
        if (NetworkMatch(mStagingNetwork, ByteSpan(configuredNetwork.networkID, configuredNetwork.networkIDLen)))
        {
            if (callback)
            {
                callback->OnResult(Status::kSuccess, CharSpan(), 0);
            }
            return;
        }
    }

    // Store the callback for later use
    mpConnectCallback = callback;

    // First, check if we already have the network in our scan results buffer
    
    // Look for the target network in our existing scan results first
    if (mScanResultCount > 0) {
        ChipLogProgress(NetworkProvisioning, "Checking existing scan results for target network...");
        
        for (uint16_t i = 0; i < mScanResultCount; i++) {
            // Check if this is our target network
            if (memcmp(mStagingNetwork.ssid, mScanResultsBuffer[i].ssid, mStagingNetwork.ssidLen) == 0) {
                target_found = true;
                target_channel = mScanResultsBuffer[i].primary;
                target_rssi = mScanResultsBuffer[i].rssi;
                
                // Log the found network details
                ChipLogProgress(NetworkProvisioning, "Target network found in existing scan results: Channel %d, RSSI %d, Auth %d",
                               mScanResultsBuffer[i].primary, mScanResultsBuffer[i].rssi, mScanResultsBuffer[i].authmode);
                break;
            }
        }
    }
    
    // If not found in existing results, perform a segmented scan like we do in StartScanWiFiNetworks
    if (!target_found) {
        ChipLogProgress(NetworkProvisioning, "Target network not in existing scan results, performing segmented scan...");
        
        // Use StartScanWiFiNetworks with the specific SSID to find our target network
        // This is a blocking function that will search for the network across all channels
        err = StartScanWiFiNetworks(ByteSpan(reinterpret_cast<const uint8_t*>(mStagingNetwork.ssid), mStagingNetwork.ssidLen));
        if (err != CHIP_NO_ERROR) {
            ChipLogError(NetworkProvisioning, "Failed to start scan for target network: %s", chip::ErrorStr(err));
            goto error_exit;
        }
        
        // Now check our updated scan results for the target network
        if (mScanResultCount > 0) {
            for (uint16_t i = 0; i < mScanResultCount; i++) {
                // Check if this is our target network
                if (memcmp(mStagingNetwork.ssid, mScanResultsBuffer[i].ssid, mStagingNetwork.ssidLen) == 0) {
                    target_found = true;
                    target_channel = mScanResultsBuffer[i].primary;
                    target_rssi = mScanResultsBuffer[i].rssi;
                    
                    // Log the found network details
                    ChipLogProgress(NetworkProvisioning, "Target network found in segmented scan: Channel %d, RSSI %d, Auth %d",
                                   mScanResultsBuffer[i].primary, mScanResultsBuffer[i].rssi, mScanResultsBuffer[i].authmode);
                    break;
                }
            }
        }
        
        if (!target_found) {
            ChipLogError(NetworkProvisioning, "Target network not found in segmented scan");
            err = CHIP_ERROR_NOT_FOUND;
            goto error_exit;
        }
    }
    
    // Now connect to the network
    ChipLogProgress(NetworkProvisioning, "Network found, connecting to WiFi network on channel %d...", target_channel);
    err = ConnectWiFiNetwork(reinterpret_cast<const char *>(mStagingNetwork.ssid), mStagingNetwork.ssidLen,
                            reinterpret_cast<const char *>(mStagingNetwork.credentials), mStagingNetwork.credentialsLen,
                            target_channel);

    if (err == CHIP_NO_ERROR) {
        // Start a timer to detect connection failure
        err = DeviceLayer::SystemLayer().StartTimer(
            static_cast<System::Clock::Timeout>(kWiFiConnectNetworkTimeoutSeconds * secToMiliSec), OnConnectWiFiNetworkFailed, NULL);
    }

