JordyDH/esp-matter-lp/connectedhomeip/connectedhomeip/src/platform/ESP32/NetworkCommissioningDriver.cpp
exit:
    if (err != CHIP_NO_ERROR)
    {
        networkingStatus = Status::kUnknownError;
    }
    if (networkingStatus != Status::kSuccess)
    {
        ChipLogError(NetworkProvisioning, "Failed to connect to WiFi network:%s", chip::ErrorStr(err));
        mpConnectCallback = nullptr;
        callback->OnResult(networkingStatus, CharSpan(), 0);
    }
    return;

error_exit:
    ChipLogError(NetworkProvisioning, "Failed to connect to WiFi network:%s", chip::ErrorStr(err));
    mpConnectCallback = nullptr;
    if (callback) {
        callback->OnResult(Status::kNetworkNotFound, CharSpan(), 0);
    }
    return;
}

CHIP_ERROR ESPWiFiDriver::StartScanWiFiNetworks(ByteSpan ssid)
{
    ChipLogProgress(DeviceLayer, "ONEDGE - Delay 1000ms - START");
    vTaskDelay(pdMS_TO_TICKS(1000));
    ChipLogProgress(DeviceLayer, "ONEDGE - Delay 1000ms - STOP");
    esp_err_t err = ESP_OK;
    ESP_LOGI(TAG, "WIFI SCAN CALLED - PATCH HERE");
    
    // If an SSID is provided, use standard single scan
    if (!ssid.empty())
    {
        ESP_LOGI(TAG, "%s", ssid.data());
        wifi_scan_config_t scan_config = { 0 };
        memset(WiFiSSIDStr, 0, sizeof(WiFiSSIDStr));
        memcpy(WiFiSSIDStr, ssid.data(), ssid.size());
        scan_config.ssid = WiFiSSIDStr;
        err = esp_wifi_scan_start(&scan_config, false);
    }
    else
    {
        ESP_LOGI(TAG, "NO SSID PROVIDED - Using chunked scan");
        
        // Define constants for chunked scanning
        constexpr uint8_t kTotalChannels = 13;      // Total 2.4GHz WiFi channels
        constexpr uint8_t kChunksCount = 3;         // Number of chunks to divide scanning into
        constexpr uint8_t kChannelsPerChunk = 5;    // Approximate channels per chunk
        constexpr uint16_t kRechargePauseMs = 1000; // Pause between chunks

        // Reset our results buffer
        mScanResultCount = 0;
        
        // Perform chunked scanning - each chunk scans a subset of channels
        for (uint8_t chunk = 0; chunk < kChunksCount; chunk++) 
        {
            // Calculate the channel for this chunk with explicit bounds checking
            uint8_t channel;
            if (chunk == 0) {
                channel = 1; // First channel
            } else {
                // Ensure we don't overflow uint8_t by using proper bounds checking
                unsigned int calculatedChannel = 1U + (static_cast<unsigned int>(chunk) * static_cast<unsigned int>(kChannelsPerChunk));
                // Ensure the channel is within valid range (1-13)
                channel = static_cast<uint8_t>(calculatedChannel <= 13U ? calculatedChannel : 13U);
            }
            if (channel > kTotalChannels) {
                break; // We've covered all channels
            }
            
            ChipLogProgress(DeviceLayer, "Starting scan chunk %d/%d on channel %d", 
                            chunk+1, kChunksCount, channel);
            
            // Configure scan for just this channel
            wifi_scan_config_t scan_config = { 0 };
            scan_config.channel = channel;
            
            // Start scan for this channel in blocking mode
            err = esp_wifi_scan_start(&scan_config, true);
            if (err != ESP_OK) {
                ChipLogError(DeviceLayer, "Failed to start scan for chunk %d: %s", 
                           chunk, esp_err_to_name(err));
                continue; // Try next chunk
            }
            
            // Immediately process results from this chunk
            uint16_t ap_count = 0;
            err = esp_wifi_scan_get_ap_num(&ap_count);
            if (err != ESP_OK) {
                ChipLogError(DeviceLayer, "Failed to get AP count for chunk %d: %s", 
                           chunk, esp_err_to_name(err));
                ap_count = 0;
            }
            
            if (ap_count > 0) {
                ChipLogProgress(DeviceLayer, "Found %d APs in chunk %d", ap_count, chunk+1);
                
                // Allocate temporary buffer for this chunk's results
                wifi_ap_record_t* temp_records = static_cast<wifi_ap_record_t*>(
                    malloc(ap_count * sizeof(wifi_ap_record_t))
                );
                
                if (temp_records != nullptr) {
                    // Get the scan records
                    uint16_t to_copy = ap_count;
                    err = esp_wifi_scan_get_ap_records(&to_copy, temp_records);
                    if (err == ESP_OK) {
                        // Log detailed information about APs found in this chunk
                        ChipLogProgress(DeviceLayer, "===== Chunk %d/%d (Channel %d) Details =====", 
                                       chunk+1, kChunksCount, channel);
                        for (uint16_t i = 0; i < to_copy; i++) {
                            const char* ap_ssid = reinterpret_cast<const char*>(temp_records[i].ssid);
                            char bssid_str[18]; // XX:XX:XX:XX:XX:XX + null terminator
                            snprintf(bssid_str, sizeof(bssid_str), "%02x:%02x:%02x:%02x:%02x:%02x",
                                    temp_records[i].bssid[0], temp_records[i].bssid[1], temp_records[i].bssid[2],
                                    temp_records[i].bssid[3], temp_records[i].bssid[4], temp_records[i].bssid[5]);
                            
                            ChipLogProgress(DeviceLayer, "  AP %d: SSID=\"%s\", BSSID=%s, Ch=%d, RSSI=%d, Auth=%d", 
                                           i+1, ap_ssid, bssid_str, temp_records[i].primary,
                                           temp_records[i].rssi, temp_records[i].authmode);
                        }
                        ChipLogProgress(DeviceLayer, "========================================");
                        
                        // Process and deduplicate the results
                        for (uint16_t i = 0; i < to_copy; i++) {
                            // Check if this AP is already in our results
                            bool is_duplicate = false;
                            
