JordyDH/esp-matter-lp/connectedhomeip/connectedhomeip/src/platform/ESP32/NetworkCommissioningDriver.cpp
                            for (uint16_t j = 0; j < mScanResultCount; j++) {
                                // Compare BSSIDs (MAC addresses)
                                if (memcmp(temp_records[i].bssid, mScanResultsBuffer[j].bssid, 6) == 0) {
                                    is_duplicate = true;
                                    // If this is a stronger signal, update the existing entry
                                    if (temp_records[i].rssi > mScanResultsBuffer[j].rssi) {
                                        mScanResultsBuffer[j] = temp_records[i];
                                    }
                                    break;
                                }
                            }
                            
                            // If not a duplicate and we have space, add it to our results
                            if (!is_duplicate && mScanResultCount < kMaxWiFiScanResults) {
                                mScanResultsBuffer[mScanResultCount++] = temp_records[i];
                            }
                        }
                    } else {
                        ChipLogError(DeviceLayer, "Failed to get scan records for chunk %d: %s", 
                                   chunk, esp_err_to_name(err));
                    }
                    
                    // Clean up temporary buffer
                    free(temp_records);
                }
            }
            
            // Pause after scan chunk to allow power system to recharge
            ChipLogProgress(DeviceLayer, "Pausing after scan chunks for power recharge");
            vTaskDelay(pdMS_TO_TICKS(kRechargePauseMs));
        }
        
        // After all chunks are done, log detailed summary but DO NOT call the callback
        // The callback will be called from OnScanWiFiNetworkDone after all chunks are processed
        if (mScanResultCount > 0) {
            ChipLogProgress(DeviceLayer, "===== CHUNKED SCAN COMPLETE =====");
            ChipLogProgress(DeviceLayer, "Chunked scan found %d unique networks", mScanResultCount);
            
            // Log information about all unique networks found
            for (uint16_t i = 0; i < mScanResultCount; i++) {
                const char* result_ssid = reinterpret_cast<const char*>(mScanResultsBuffer[i].ssid);
                char bssid_str[18]; // XX:XX:XX:XX:XX:XX + null terminator
                snprintf(bssid_str, sizeof(bssid_str), "%02x:%02x:%02x:%02x:%02x:%02x",
                        mScanResultsBuffer[i].bssid[0], mScanResultsBuffer[i].bssid[1], 
                        mScanResultsBuffer[i].bssid[2], mScanResultsBuffer[i].bssid[3], 
                        mScanResultsBuffer[i].bssid[4], mScanResultsBuffer[i].bssid[5]);
                
                ChipLogProgress(DeviceLayer, "  Network %d: SSID=\"%s\", BSSID=%s, Ch=%d, RSSI=%d, Auth=%d", 
                               i+1, result_ssid, bssid_str, mScanResultsBuffer[i].primary,
                               mScanResultsBuffer[i].rssi, mScanResultsBuffer[i].authmode);
            }
            ChipLogProgress(DeviceLayer, "==================================");
        } else {
            ChipLogProgress(DeviceLayer, "Chunked scan complete, no networks found");
        }
        
        // Set flags for tracking chunked scan events
        mChunkedScanInProgress = true;
        mChunksCompleted = 0; // Will be incremented in OnScanWiFiNetworkDone
        mTotalChunks = kChunksCount; // Store total chunks for tracking
        
        // Return success since we've already processed the results
        return CHIP_NO_ERROR;
    }
    
    if (err != ESP_OK)
    {
        return chip::DeviceLayer::Internal::ESP32Utils::MapError(err);
    }
    return CHIP_NO_ERROR;
}

void ESPWiFiDriver::OnScanWiFiNetworkDone()
{
    if (!mpScanCallback)
    {
        ChipLogProgress(DeviceLayer, "No scan callback");
        return;
    }
    
    // Check if this is part of a chunked scan
    if (mChunkedScanInProgress) {
        // Increment the chunks completed counter
        mChunksCompleted++;
        ChipLogProgress(DeviceLayer, "Chunked scan event %d of %d received", mChunksCompleted, mTotalChunks);
        
        // If this is not the last chunk, just wait for more events
        if (mChunksCompleted < mTotalChunks) {
            return;
        }
        
        // This is the last chunk, now we can process our accumulated results
        ChipLogProgress(DeviceLayer, "All chunked scan events received, processing results");
        
        if (mScanResultCount > 0) {
            ChipLogProgress(DeviceLayer, "===== FINAL SCAN RESULTS =====");
            ChipLogProgress(DeviceLayer, "Using %d accumulated scan results from chunked scan", mScanResultCount);
            
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 1, 3)
            // ESP-IDF 5.1.3+ only needs size
            ESPScanResponseIterator iter(mScanResultCount);
#else
            // Create an iterator with our accumulated results
            ESPScanResponseIterator iter(mScanResultCount, const_cast<const wifi_ap_record_t*>(&mScanResultsBuffer[0]));
#endif
            mpScanCallback->OnFinished(Status::kSuccess, CharSpan(), &iter);
        } else {
            ChipLogProgress(DeviceLayer, "No networks found in chunked scan");
            mpScanCallback->OnFinished(Status::kSuccess, CharSpan(), nullptr);
        }
        
        // Reset chunked scan state
        mChunkedScanInProgress = false;
        mpScanCallback = nullptr;
        return;
    }
    
    // Standard scan handling for specific SSID scans
    uint16_t ap_number;
    esp_wifi_scan_get_ap_num(&ap_number);
    ESP_LOGI(TAG, "AP's found %d", ap_number);
    if (!ap_number)
    {
        ChipLogProgress(DeviceLayer, "No AP found");
        mpScanCallback->OnFinished(Status::kSuccess, CharSpan(), nullptr);
        mpScanCallback = nullptr;
        return;
    }

    // For standard scans, copy the results to our buffer first to maintain consistency
    ap_number = std::min(ap_number, static_cast<uint16_t>(kMaxWiFiScanResults));
    
    if (esp_wifi_scan_get_ap_records(&ap_number, mScanResultsBuffer) == ESP_OK)
    {
        mScanResultCount = ap_number;
        ChipLogProgress(DeviceLayer, "Standard scan complete, found %d networks", mScanResultCount);
        
